app/controllers/ceus_controller.rb

SELECT "ceus".* FROM "ceus"
---
  def index
    @ceus = Ceu.all