app/controllers/usstates_controller.rb

  def index
    @usstates = Usstate.all
---
SELECT "usstates".* FROM "usstates"

    def set_usstate
      @usstate = Usstate.find(params[:id])
---
SELECT "usstates".* FROM "usstates" WHERE "usstates"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]